app/views/rentals/reserve_car.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."license" IS NULL LIMIT ?  [["LIMIT", 1]]
---
 <!--<= button_to "Reserve", '/car_reserved', :method => 'post'%>-->
 <!--<= button_to "Reserve", :action => "car_reserved", :controller =>"rentals", @car=> Car.where(:license => params[:license]) %>-->