app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("license", "manufacturer", "model", "rate", "style", "location", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def list_cars
    @cars = Car.all
    @location = params[:location]
    @model = params[:model]
    @manufacturer = params[:manufacturer]
    @style = params[:style]
    @status = params[:status]
    if(!@manufacturer.empty?)
      @cars = @cars.where(:manufacturer => @manufacturer)
    end
    if(!@model.empty?)
      @cars = @cars.where(:model => @model)
    end
    if(!@location.empty?)
      @cars = @cars.where(:location => @location)
    end
    if(!@style.empty?)
      @cars = @cars.where(:style => @style)
    end
    if(!@status.empty?)
      @cars = @cars.where(:status => @status)
---
SELECT "cars".* FROM "cars"
SELECT "cars".* FROM "cars" WHERE "cars"."model" = ?  [["model", "A4"]]
SELECT "cars".* FROM "cars" WHERE "cars"."location" = ? AND "cars"."model" = ?  [["location", "Raleigh"], ["model", "A4"]]
SELECT "cars".* FROM "cars" WHERE "cars"."location" = ? AND "cars"."style" = ?  [["location", "Raleigh"], ["style", "Coupe"]]
SELECT "cars".* FROM "cars" WHERE "cars"."manufacturer" = ? AND "cars"."model" = ? AND "cars"."location" = ? AND "cars"."style" = ? AND "cars"."status" = ?  [["manufacturer", "Audi"], ["model", "A4"], ["location", "Raleigh"], ["style", "Coupe"], ["status", "Available"]]