app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)
    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("email", "name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "tkothar@ncsu.edu"], ["name", "Tanay Kothari"], ["password", "12345678"], ["created_at", "2017-09-24 16:44:20.814211"], ["updated_at", "2017-09-24 16:44:20.814211"]]