app/controllers/rentals_controller.rb

  def check_reserve_car
    @customer = current_customer
    @previous_rental = Rental.where(:email => @customer.email).last
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."email" = ? ORDER BY "rentals"."id" DESC LIMIT ?  [["email", "a"], ["LIMIT", 1]]

  def reserve_car
    @car = Car.where(:license => params[:license])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."license" IS NULL LIMIT ?  [["LIMIT", 1]]

  def reserve_in_db
    @email = current_customer.email
    @license = params[:license]
    @checkout = params[:checkout]
    @return = params[:return]
    @hours = 3
    @rental_charge = @hours*Car.where(:license => @license)[0].rate
    @rental = Rental.new
    @rental.email= @email
    @rental.license= @license
    @rental.checkout= @checkout
    @rental.return= @return
    @rental.hours= @hours
    @rental.rental_charge= @rental_charge
    @rental.status= 'Reserved'
    @car = Car.where(:license => @license)[0]
    @car.status= 'Reserved'
    @customer = Customer.where(:email => @email)[0]
    @customer.rental_charge= @rental_charge
    if @rental.save! and @car.save! and @customer.save!
---
SELECT "cars".* FROM "cars" WHERE "cars"."license" = ?  [["license", "0000003"]]
INSERT INTO "rentals" ("email", "license", "checkout", "return", "hours", "rental_charge", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def car_reserved
    @car = Car.where(:license => params[:license])
---
SELECT "cars".* FROM "cars" WHERE "cars"."license" = ?  [["license", "0000001"]]

  def checkout
    @rental = Rental.where(:email => current_customer.email).last!
    Rental.update(@rental.id, :status => "Checked out")
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."email" = ? ORDER BY "rentals"."id" DESC LIMIT ?  [["email", "a"], ["LIMIT", 1]]
UPDATE "rentals" SET "status" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["status", "progress"], ["updated_at", "2017-09-25 19:38:04.816263"], ["id", 1]]

  def checkout_history
    if !params[:customer].nil?
      @rentals = Rental.where(:email => params[:customer])
---
SELECT "rentals".* FROM "rentals" WHERE "rentals"."email" = ?  [["email", "a"]]

    def set_rental
      @rental = Rental.find(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]