app/controllers/sessions_controller.rb

  def create
    # If the user exists AND the password entered is correct.
    if Customer.find_by_email_and_password(params[:email],params[:password])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? AND "customers"."password" = ? LIMIT ?  [["email", ""], ["password", ""], ["LIMIT", 1]]